Revit 2024 API
ParameterTypeId.PathReinEndHookTypen1 Property
 "Primary Bar - End Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PathReinEndHookTypen1 { get; }
Visual Basic
Public Shared ReadOnly Property PathReinEndHookTypen1 As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PathReinEndHookTypen1 {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace